In [54]:
import numpy as np
import pandas as pd

In [55]:
date = pd.read_csv('../data/List_of_Orders.csv')
time = pd.read_csv('../data/messages.csv')

In [56]:
date.head()

  Order ID  Order Date CustomerName           State       City
0  B-25601  01-04-2018       Bharat         Gujarat  Ahmedabad
1  B-25602  01-04-2018        Pearl     Maharashtra       Pune
2  B-25603  03-04-2018        Jahan  Madhya Pradesh     Bhopal
3  B-25604  03-04-2018       Divsha       Rajasthan     Jaipur
4  B-25605  05-04-2018      Kasheen     West Bengal    Kolkata

In [57]:
time.head()

                  date                                                msg
0  2012-01-02 00:21:00                            нужен парень 0965188229
1  2012-01-02 00:24:00                       Всем привет! Как настроение?
2  2012-01-02 00:27:00  ИЩЮ ВТОРУЮ ПОЛОВИНКУ МНЕ 23 ЗОВУТ ВАНЯ ПИШИТЕ ...
3  2012-01-02 00:27:00     Эля  встречала в шумной компании! Все отлично!
4  2012-01-02 00:27:00  Парень катается по городу. Нужна девушка. 0992...

In [58]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 560 entries, 0 to 559
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Order ID      500 non-null    object
 1   Order Date    500 non-null    object
 2   CustomerName  500 non-null    object
 3   State         500 non-null    object
 4   City          500 non-null    object
dtypes: object(5)
memory usage: 22.0+ KB

In [59]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1147100 entries, 0 to 1147099
Data columns (total 2 columns):
 #   Column  Non-Null Count    Dtype
---  ------  --------------    -----
 0   date    1147100 non-null  object
 1   msg     1147100 non-null  object
dtypes: object(2)
memory usage: 17.5+ MB

In [60]:
date['Order Date'] = pd.to_datetime(date['Order Date'], dayfirst=True)

In [61]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 560 entries, 0 to 559
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Order ID      500 non-null    object
 1   Order Date    500 non-null    datetime64[ns]
 2   CustomerName  500 non-null    object
 3   State         500 non-null    object
 4   City          500 non-null    object
dtypes: datetime64[ns](1), object(4)
memory usage: 22.0+ KB

In [62]:
date['Date Year'] = date['Order Date'].dt.year
date.head()

  Order ID Order Date CustomerName           State       City  Date Year
0  B-25601 2018-04-01       Bharat         Gujarat  Ahmedabad     2018.0
1  B-25602 2018-04-01        Pearl     Maharashtra       Pune     2018.0
2  B-25603 2018-04-03        Jahan  Madhya Pradesh     Bhopal     2018.0
3  B-25604 2018-04-03       Divsha       Rajasthan     Jaipur     2018.0
4  B-25605 2018-04-05      Kasheen     West Bengal    Kolkata     2018.0

In [63]:
date['Date Month'] = date['Order Date'].dt.month
date.sample(5)

,Order ID,Order Date,CustomerName,State,City,Date Year,Date Month
487,B-26088,2019-03-26,Bhavna,Sikkim,Gangtok,2019.0,3.0
153,B-25754,2018-08-18,Akshay,Bihar,Patna,2018.0,8.0
21,B-25622,2018-04-22,Monisha,Rajasthan,Jaipur,2018.0,4.0
482,B-26083,2019-03-24,Yogesh,Bihar,Patna,2019.0,3.0
506,NaN,NaT,NaN,NaN,NaN,NaN,NaN

In [64]:
date['Date Month Name'] = date['Order Date'].dt.month_name()
date.sample(5)

,Order ID,Order Date,CustomerName,State,City,Date Year,Date Month,Date Month Name
129,B-25730,2018-07-22,Rishabh,Rajasthan,Jaipur,2018.0,7.0,July
14,B-25615,2018-04-15,Bhavna,Sikkim,Gangtok,2018.0,4.0,April
131,B-25732,2018-07-27,Anubhaw,Karnataka,Bangalore,2018.0,7.0,July
284,B-25885,2018-11-28,Shatayu,Madhya Pradesh,Indore,2018.0,11.0,November
110,B-25711,2018-07-06,Sakshi,Madhya Pradesh,Bhopal,2018.0,7.0,July

In [65]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1147100 entries, 0 to 1147099
Data columns (total 2 columns):
 #   Column  Non-Null Count    Dtype
---  ------  --------------    -----
 0   date    1147100 non-null  object
 1   msg     1147100 non-null  object
dtypes: object(2)
memory usage: 17.5+ MB

In [66]:
time['date'] = pd.to_datetime(time['date'])
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1147100 entries, 0 to 1147099
Data columns (total 2 columns):
 #   Column  Non-Null Count    Dtype
---  ------  --------------    -----
 0   date    1147100 non-null  datetime64[ns]
 1   msg     1147100 non-null  object
dtypes: datetime64[ns](1), object(1)
memory usage: 17.5+ MB

In [67]:
time['hour'] = time['date'].dt.hour
time['min'] = time['date'].dt.minute

In [68]:
time.sample(5)

,date,msg,hour,min
223489,2014-07-01 00:46:00,ПАРЕНЬ ИЩЕТ ДЕВУШКУ СЕР/ОТНОШЕНИЙ МОЖНО РЕБЁН...,0,46
783856,2013-12-18 00:15:00,М.ищет преятную блонд до 26 для с/о можн с реб...,0,15
459371,2012-07-17 01:11:00,Здесь есть мужчины которые способны любить отк...,1,11
392183,2012-03-06 23:31:00,Любимый доехала нормально.что просил-сделала.п...,23,31
789354,2013-12-28 00:23:00,? ??? ????????? ????25??35????? ??????? ??????...,0,23